app/views/trips/index.html.erb

SELECT "activities"."trip_id" FROM "activities"
SELECT COUNT(*) AS count_all, trip_id AS trip_id FROM "activities" GROUP BY "activities"."trip_id"
---
<ul class="list-group">
  <% activity_count = Activity.group(:trip_id).count %>