app/views/trips/show.html.erb

<th>Name</th><th>Date</th><th>Description</th><th>Location</th>
<% @trip.activities.each do |activity| %>
---
SELECT "activities".* FROM "activities" WHERE "activities"."trip_id" = ?  [["trip_id", 1]]