app/controllers/activities_controller.rb

  def new
    @trip = Trip.find(params[:trip_id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @trip = Trip.find(params[:trip_id])
    @activity = @trip.activities.build(create_activity_params)

    if @activity.save
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "activities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Drive to the Grand Canyon"], ["created_at", "2016-01-10 21:27:19.097685"], ["updated_at", "2016-01-10 21:27:19.097685"]]

  def show
    @activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", 0]]

  def edit
    @activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    @trip = Trip.find(params[:trip_id])
    @activity = @trip.activities.find(params[:id])
    @activity.destroy
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."trip_id" = ? AND "activities"."id" = ? LIMIT 1  [["trip_id", 1], ["id", 31]]
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 31]]