app/controllers/trips_controller.rb

  def create
    @trip = current_user.trips.build create_trip_params

    if @trip.save
---
INSERT INTO "trips" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Seattle"], ["user_id", 1], ["created_at", "2016-01-09 20:06:28.135004"], ["updated_at", "2016-01-09 20:06:28.135004"]]

  def show
    @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", nil]]

  def edit
    @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 0]]

  def update
    @trip = Trip.find(params[:id])

    if @trip.update(create_trip_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "trips" SET "name" = ?, "start" = ?, "end" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["name", "San Francisco"], ["start", "2016-01-11 00:00:00.000000"], ["end", "2016-01-11 00:00:00.000000"], ["updated_at", "2016-01-11 19:11:07.136161"], ["id", 4]]

  def destroy
    @trip = Trip.find(params[:id])
    @trip.destroy
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 6]]